node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 88
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 88
          }
        }
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-026-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-018-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-029-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-007-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-006-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-053-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-026-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-023-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-038-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-042-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-024-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-010-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-043-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-040-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-012-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-045-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-028-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-037-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-055-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-019-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-014-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-039-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-024-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-035-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-044-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-033-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-033-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-027-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-010-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-016-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-008-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-058-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-023-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-030-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-017-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-018-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-048-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-021-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-017-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-034-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-047-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-041-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-012-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-035-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-011-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-029-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-032-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-059-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-027-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-025-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-014-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-030-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-028-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-036-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-062-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-056-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-057-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-054-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-013-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-009-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-034-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-046-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-009-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-022-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-049-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-051-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-011-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-013-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-031-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-021-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-038-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-019-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-052-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-032-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-020-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-015-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-016-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-060-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-036-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-037-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-008-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-005-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-031-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-050-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-025-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-061-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-022-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-015-01-sz1.png"
      }
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 88
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 88
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000\006\000\000\000\000\000\000\000\007\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000\t\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\r\000\000\000\000\000\000\000\016\000\000\000\000\000\000\000\017\000\000\000\000\000\000\000\020\000\000\000\000\000\000\000\021\000\000\000\000\000\000\000\022\000\000\000\000\000\000\000\023\000\000\000\000\000\000\000\024\000\000\000\000\000\000\000\025\000\000\000\000\000\000\000\026\000\000\000\000\000\000\000\027\000\000\000\000\000\000\000\030\000\000\000\000\000\000\000\031\000\000\000\000\000\000\000\032\000\000\000\000\000\000\000\033\000\000\000\000\000\000\000\034\000\000\000\000\000\000\000\035\000\000\000\000\000\000\000\036\000\000\000\000\000\000\000\037\000\000\000\000\000\000\000 \000\000\000\000\000\000\000!\000\000\000\000\000\000\000\"\000\000\000\000\000\000\000#\000\000\000\000\000\000\000$\000\000\000\000\000\000\000%\000\000\000\000\000\000\000&\000\000\000\000\000\000\000\'\000\000\000\000\000\000\000(\000\000\000\000\000\000\000)\000\000\000\000\000\000\000*\000\000\000\000\000\000\000+\000\000\000\000\000\000\000,\000\000\000\000\000\000\000-\000\000\000\000\000\000\000.\000\000\000\000\000\000\000/\000\000\000\000\000\000\0000\000\000\000\000\000\000\0001\000\000\000\000\000\000\0002\000\000\000\000\000\000\0003\000\000\000\000\000\000\0004\000\000\000\000\000\000\0005\000\000\000\000\000\000\0006\000\000\000\000\000\000\0007\000\000\000\000\000\000\0008\000\000\000\000\000\000\0009\000\000\000\000\000\000\000:\000\000\000\000\000\000\000;\000\000\000\000\000\000\000<\000\000\000\000\000\000\000=\000\000\000\000\000\000\000>\000\000\000\000\000\000\000?\000\000\000\000\000\000\000@\000\000\000\000\000\000\000A\000\000\000\000\000\000\000B\000\000\000\000\000\000\000C\000\000\000\000\000\000\000D\000\000\000\000\000\000\000E\000\000\000\000\000\000\000F\000\000\000\000\000\000\000G\000\000\000\000\000\000\000H\000\000\000\000\000\000\000I\000\000\000\000\000\000\000J\000\000\000\000\000\000\000K\000\000\000\000\000\000\000L\000\000\000\000\000\000\000M\000\000\000\000\000\000\000N\000\000\000\000\000\000\000O\000\000\000\000\000\000\000P\000\000\000\000\000\000\000Q\000\000\000\000\000\000\000R\000\000\000\000\000\000\000S\000\000\000\000\000\000\000T\000\000\000\000\000\000\000U\000\000\000\000\000\000\000V\000\000\000\000\000\000\000W\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "input_producer/Shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 88
      }
    }
  }
}
node {
  name: "input_producer/strided_slice/stack"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "input_producer/strided_slice/stack_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_producer/strided_slice/stack_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_producer/strided_slice"
  op: "StridedSlice"
  input: "input_producer/Shape"
  input: "input_producer/strided_slice/stack"
  input: "input_producer/strided_slice/stack_1"
  input: "input_producer/strided_slice/stack_2"
  device: "/device:CPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "input_producer/input_producer/range/start"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "input_producer/input_producer/range/delta"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_producer/input_producer/range"
  op: "Range"
  input: "input_producer/input_producer/range/start"
  input: "input_producer/strided_slice"
  input: "input_producer/input_producer/range/delta"
  device: "/device:CPU:0"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "input_producer/input_producer/RandomShuffle"
  op: "RandomShuffle"
  input: "input_producer/input_producer/range"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 10
    }
  }
}
node {
  name: "input_producer/input_producer"
  op: "FIFOQueueV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 1000
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_INT32
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "input_producer/input_producer/input_producer_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "input_producer/input_producer"
  input: "input_producer/input_producer/RandomShuffle"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_INT32
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "input_producer/input_producer/input_producer_Close"
  op: "QueueCloseV2"
  input: "input_producer/input_producer"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "input_producer/input_producer/input_producer_Close_1"
  op: "QueueCloseV2"
  input: "input_producer/input_producer"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "input_producer/input_producer/input_producer_Size"
  op: "QueueSizeV2"
  input: "input_producer/input_producer"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "input_producer/input_producer/Cast"
  op: "Cast"
  input: "input_producer/input_producer/input_producer_Size"
  device: "/device:CPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "input_producer/input_producer/mul/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000475
      }
    }
  }
}
node {
  name: "input_producer/input_producer/mul"
  op: "Mul"
  input: "input_producer/input_producer/Cast"
  input: "input_producer/input_producer/mul/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "input_producer/input_producer/fraction_of_1000_full/tags"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "input_producer/input_producer/fraction_of_1000_full"
      }
    }
  }
}
node {
  name: "input_producer/input_producer/fraction_of_1000_full"
  op: "ScalarSummary"
  input: "input_producer/input_producer/fraction_of_1000_full/tags"
  input: "input_producer/input_producer/mul"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "input_producer/input_producer_Dequeue"
  op: "QueueDequeueV2"
  input: "input_producer/input_producer"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_INT32
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "input_producer/Gather"
  op: "Gather"
  input: "Const"
  input: "input_producer/input_producer_Dequeue"
  device: "/device:CPU:0"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "input_producer/Gather_1"
  op: "Gather"
  input: "Const_1"
  input: "input_producer/input_producer_Dequeue"
  device: "/device:CPU:0"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "ReadFile"
  op: "ReadFile"
  input: "input_producer/Gather"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "DecodePng"
  op: "DecodePng"
  input: "ReadFile"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "channels"
    value {
      i: 1
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_UINT8
    }
  }
}
node {
  name: "Cast"
  op: "Cast"
  input: "DecodePng"
  device: "/device:CPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "control_dependency"
  op: "Identity"
  input: "Cast"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Cast"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "Shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "@\000\000\000@\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "Const_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Prod"
  op: "Prod"
  input: "Shape"
  input: "Const_2"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Const_3"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "Mean"
  op: "Mean"
  input: "control_dependency"
  input: "Const_3"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Square"
  op: "Square"
  input: "control_dependency"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "Const_4"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "Mean_1"
  op: "Mean"
  input: "Square"
  input: "Const_4"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Square_1"
  op: "Square"
  input: "Mean"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "sub"
  op: "Sub"
  input: "Mean_1"
  input: "Square_1"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Relu"
  op: "Relu"
  input: "sub"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Sqrt"
  op: "Sqrt"
  input: "Relu"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Cast_2"
  op: "Cast"
  input: "Prod"
  device: "/device:CPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Rsqrt"
  op: "Rsqrt"
  input: "Cast_2"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Maximum"
  op: "Maximum"
  input: "Sqrt"
  input: "Rsqrt"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Sub"
  op: "Sub"
  input: "control_dependency"
  input: "Mean"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "div"
  op: "RealDiv"
  input: "Sub"
  input: "Maximum"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "add/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "add"
  op: "Add"
  input: "div"
  input: "add/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "div_1/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 2.0
      }
    }
  }
}
node {
  name: "div_1"
  op: "RealDiv"
  input: "add"
  input: "div_1/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "batch/Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: true
      }
    }
  }
}
node {
  name: "batch/fifo_queue"
  op: "FIFOQueueV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 1000
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "batch/fifo_queue_enqueue"
  op: "QueueEnqueueV2"
  input: "batch/fifo_queue"
  input: "div_1"
  input: "input_producer/Gather_1"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "batch/fifo_queue_Close"
  op: "QueueCloseV2"
  input: "batch/fifo_queue"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "batch/fifo_queue_Close_1"
  op: "QueueCloseV2"
  input: "batch/fifo_queue"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "batch/fifo_queue_Size"
  op: "QueueSizeV2"
  input: "batch/fifo_queue"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch/Cast"
  op: "Cast"
  input: "batch/fifo_queue_Size"
  device: "/device:CPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch/mul/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000475
      }
    }
  }
}
node {
  name: "batch/mul"
  op: "Mul"
  input: "batch/Cast"
  input: "batch/mul/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch/fraction_of_1000_full/tags"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "batch/fraction_of_1000_full"
      }
    }
  }
}
node {
  name: "batch/fraction_of_1000_full"
  op: "ScalarSummary"
  input: "batch/fraction_of_1000_full/tags"
  input: "batch/mul"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch/n"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 100
      }
    }
  }
}
node {
  name: "batch"
  op: "QueueDequeueManyV2"
  input: "batch/fifo_queue"
  input: "batch/n"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 100
          }
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 100
          }
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "Const_5"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 88
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 88
          }
        }
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-026-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-018-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-029-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-007-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-006-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-053-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-026-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-023-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-038-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-042-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-024-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-010-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-043-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-040-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-012-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-045-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-028-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-037-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-055-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-019-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-014-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-039-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-024-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-035-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-044-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-033-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-033-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-027-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-010-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-016-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-008-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-058-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-023-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-030-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-017-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-018-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-048-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-021-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-017-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-034-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-047-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-041-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-012-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-035-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-011-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-029-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-032-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-059-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-027-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-025-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-014-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-030-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-028-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-036-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-062-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-056-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-057-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-054-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-013-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-009-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-034-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-046-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-009-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-022-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-049-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-051-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-011-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-013-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-031-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-021-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-038-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-019-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-052-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-032-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-020-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-015-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-016-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-060-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-036-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-037-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-008-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-005-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-031-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-050-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-025-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-061-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-022-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-015-01-sz1.png"
      }
    }
  }
}
node {
  name: "Const_6"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 88
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 88
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000\006\000\000\000\000\000\000\000\007\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000\t\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\r\000\000\000\000\000\000\000\016\000\000\000\000\000\000\000\017\000\000\000\000\000\000\000\020\000\000\000\000\000\000\000\021\000\000\000\000\000\000\000\022\000\000\000\000\000\000\000\023\000\000\000\000\000\000\000\024\000\000\000\000\000\000\000\025\000\000\000\000\000\000\000\026\000\000\000\000\000\000\000\027\000\000\000\000\000\000\000\030\000\000\000\000\000\000\000\031\000\000\000\000\000\000\000\032\000\000\000\000\000\000\000\033\000\000\000\000\000\000\000\034\000\000\000\000\000\000\000\035\000\000\000\000\000\000\000\036\000\000\000\000\000\000\000\037\000\000\000\000\000\000\000 \000\000\000\000\000\000\000!\000\000\000\000\000\000\000\"\000\000\000\000\000\000\000#\000\000\000\000\000\000\000$\000\000\000\000\000\000\000%\000\000\000\000\000\000\000&\000\000\000\000\000\000\000\'\000\000\000\000\000\000\000(\000\000\000\000\000\000\000)\000\000\000\000\000\000\000*\000\000\000\000\000\000\000+\000\000\000\000\000\000\000,\000\000\000\000\000\000\000-\000\000\000\000\000\000\000.\000\000\000\000\000\000\000/\000\000\000\000\000\000\0000\000\000\000\000\000\000\0001\000\000\000\000\000\000\0002\000\000\000\000\000\000\0003\000\000\000\000\000\000\0004\000\000\000\000\000\000\0005\000\000\000\000\000\000\0006\000\000\000\000\000\000\0007\000\000\000\000\000\000\0008\000\000\000\000\000\000\0009\000\000\000\000\000\000\000:\000\000\000\000\000\000\000;\000\000\000\000\000\000\000<\000\000\000\000\000\000\000=\000\000\000\000\000\000\000>\000\000\000\000\000\000\000?\000\000\000\000\000\000\000@\000\000\000\000\000\000\000A\000\000\000\000\000\000\000B\000\000\000\000\000\000\000C\000\000\000\000\000\000\000D\000\000\000\000\000\000\000E\000\000\000\000\000\000\000F\000\000\000\000\000\000\000G\000\000\000\000\000\000\000H\000\000\000\000\000\000\000I\000\000\000\000\000\000\000J\000\000\000\000\000\000\000K\000\000\000\000\000\000\000L\000\000\000\000\000\000\000M\000\000\000\000\000\000\000N\000\000\000\000\000\000\000O\000\000\000\000\000\000\000P\000\000\000\000\000\000\000Q\000\000\000\000\000\000\000R\000\000\000\000\000\000\000S\000\000\000\000\000\000\000T\000\000\000\000\000\000\000U\000\000\000\000\000\000\000V\000\000\000\000\000\000\000W\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "input_producer_1/Shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 88
      }
    }
  }
}
node {
  name: "input_producer_1/strided_slice/stack"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "input_producer_1/strided_slice/stack_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_producer_1/strided_slice/stack_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_producer_1/strided_slice"
  op: "StridedSlice"
  input: "input_producer_1/Shape"
  input: "input_producer_1/strided_slice/stack"
  input: "input_producer_1/strided_slice/stack_1"
  input: "input_producer_1/strided_slice/stack_2"
  device: "/device:CPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
