node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 188
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 188
          }
        }
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f-043-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-032-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-037-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-009-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-030-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f-041-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-061-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-083-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-047-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-034-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-025-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-009-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-054-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-037-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-036-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-045-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-010-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-005-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-020-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-019-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-028-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-010-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-031-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-064-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-055-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-008-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-071-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-082-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-087-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-015-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-013-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-069-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-075-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-078-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-017-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-044-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-072-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-001-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-040-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-011-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-026-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-006-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-093-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-080-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f-039-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-042-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-015-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-097-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-031-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-009-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-060-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-034-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-036-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-051-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-028-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-056-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-095-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-088-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-031-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-001-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-046-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-009-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-011-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-024-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-016-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-077-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-021-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f-042-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-041-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-086-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-015-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-005-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-028-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-027-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-022-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-007-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-008-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-003-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-022-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-011-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-023-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-017-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-016-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-029-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-012-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-004-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-033-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-023-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-006-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-063-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-035-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-101-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-014-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-010-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-037-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-002-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-008-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-013-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-018-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-089-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-015-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-017-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-011-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-058-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-012-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-068-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-013-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-085-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-038-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-023-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f-040-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-098-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-024-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-016-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-002-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-039-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-041-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-033-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-038-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-090-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-048-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-026-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-070-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-014-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-062-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-004-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-036-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-030-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-100-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-076-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-003-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-043-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-029-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-019-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-033-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-032-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-035-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-050-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-014-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-018-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-027-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-007-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-007-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-021-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-030-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-092-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-025-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-049-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-081-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-067-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-019-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-052-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-006-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-026-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-084-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-074-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-091-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-013-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-018-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-099-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-012-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/f1-010-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-065-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-014-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-020-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-040-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-027-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-008-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-021-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-024-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-034-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-066-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-039-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-025-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-057-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-079-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-096-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-005-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-053-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-038-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-094-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-032-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/M2-059-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-029-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-012-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m1-022-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/m-073-01-sz1.png"
        string_val: "/home/mhasek/Documents/CIS680/datasets/cufs/imgs/F2-035-01-sz1.png"
      }
    }
  }
}
node {
  name: "input_producer/Shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 188
      }
    }
  }
}
node {
  name: "input_producer/strided_slice/stack"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "input_producer/strided_slice/stack_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_producer/strided_slice/stack_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_producer/strided_slice"
  op: "StridedSlice"
  input: "input_producer/Shape"
  input: "input_producer/strided_slice/stack"
  input: "input_producer/strided_slice/stack_1"
  input: "input_producer/strided_slice/stack_2"
  device: "/device:CPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "input_producer/input_producer/range/start"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "input_producer/input_producer/range/delta"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "input_producer/input_producer/range"
  op: "Range"
  input: "input_producer/input_producer/range/start"
  input: "input_producer/strided_slice"
  input: "input_producer/input_producer/range/delta"
  device: "/device:CPU:0"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "input_producer/input_producer/RandomShuffle"
  op: "RandomShuffle"
  input: "input_producer/input_producer/range"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 9
    }
  }
}
node {
  name: "input_producer/input_producer"
  op: "FIFOQueueV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 500
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_INT32
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "input_producer/input_producer/input_producer_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "input_producer/input_producer"
  input: "input_producer/input_producer/RandomShuffle"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_INT32
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "input_producer/input_producer/input_producer_Close"
  op: "QueueCloseV2"
  input: "input_producer/input_producer"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "input_producer/input_producer/input_producer_Close_1"
  op: "QueueCloseV2"
  input: "input_producer/input_producer"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "input_producer/input_producer/input_producer_Size"
  op: "QueueSizeV2"
  input: "input_producer/input_producer"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "input_producer/input_producer/Cast"
  op: "Cast"
  input: "input_producer/input_producer/input_producer_Size"
  device: "/device:CPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "input_producer/input_producer/mul/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.00200000009499
      }
    }
  }
}
node {
  name: "input_producer/input_producer/mul"
  op: "Mul"
  input: "input_producer/input_producer/Cast"
  input: "input_producer/input_producer/mul/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "input_producer/input_producer/fraction_of_500_full/tags"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "input_producer/input_producer/fraction_of_500_full"
      }
    }
  }
}
node {
  name: "input_producer/input_producer/fraction_of_500_full"
  op: "ScalarSummary"
  input: "input_producer/input_producer/fraction_of_500_full/tags"
  input: "input_producer/input_producer/mul"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "input_producer/input_producer_Dequeue"
  op: "QueueDequeueV2"
  input: "input_producer/input_producer"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_INT32
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "input_producer/Gather"
  op: "Gather"
  input: "Const"
  input: "input_producer/input_producer_Dequeue"
  device: "/device:CPU:0"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "ReadFile"
  op: "ReadFile"
  input: "input_producer/Gather"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "DecodePng"
  op: "DecodePng"
  input: "ReadFile"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "channels"
    value {
      i: 1
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_UINT8
    }
  }
}
node {
  name: "Cast"
  op: "Cast"
  input: "DecodePng"
  device: "/device:CPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "div/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 127.5
      }
    }
  }
}
node {
  name: "div"
  op: "RealDiv"
  input: "Cast"
  input: "div/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "sub/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "sub"
  op: "Sub"
  input: "div"
  input: "sub/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "batch/Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: true
      }
    }
  }
}
node {
  name: "batch/fifo_queue"
  op: "FIFOQueueV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 500
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "batch/fifo_queue_enqueue"
  op: "QueueEnqueueV2"
  input: "batch/fifo_queue"
  input: "sub"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "batch/fifo_queue_Close"
  op: "QueueCloseV2"
  input: "batch/fifo_queue"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "batch/fifo_queue_Close_1"
  op: "QueueCloseV2"
  input: "batch/fifo_queue"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "batch/fifo_queue_Size"
  op: "QueueSizeV2"
  input: "batch/fifo_queue"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch/Cast"
  op: "Cast"
  input: "batch/fifo_queue_Size"
  device: "/device:CPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch/mul/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.00200000009499
      }
    }
  }
}
node {
  name: "batch/mul"
  op: "Mul"
  input: "batch/Cast"
  input: "batch/mul/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch/fraction_of_500_full/tags"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "batch/fraction_of_500_full"
      }
    }
  }
}
node {
  name: "batch/fraction_of_500_full"
  op: "ScalarSummary"
  input: "batch/fraction_of_500_full/tags"
  input: "batch/mul"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch/n"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 50
      }
    }
  }
}
node {
  name: "batch"
  op: "QueueDequeueManyV2"
  input: "batch/fifo_queue"
  input: "batch/n"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 50
          }
          dim {
            size: 64
          }
          dim {
            size: 64
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "step/initial_value"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "step"
  op: "VariableV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "step/Assign"
  op: "Assign"
  input: "step"
  input: "step/initial_value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "step/read"
  op: "Identity"
  input: "step"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "lr/initial_value"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000475
      }
    }
  }
}
node {
  name: "lr"
  op: "VariableV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "lr/Assign"
  op: "Assign"
  input: "lr"
  input: "lr/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lr"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "lr/read"
  op: "Identity"
  input: "lr"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lr"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.954095482826
      }
    }
  }
}
node {
  name: "mul"
  op: "Mul"
  input: "lr/read"
  input: "mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "lr_update"
  op: "Assign"
  input: "lr"
  input: "mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lr"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "random_uniform/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "2\000\000\000d\000\000\000"
      }
    }
  }
}
node {
  name: "random_uniform/min"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -1.0
      }
    }
  }
}
node {
  name: "random_uniform/max"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 50
          }
          dim {
            size: 100
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 56
    }
  }
}
node {
  name: "random_uniform/sub"
  op: "Sub"
  input: "random_uniform/max"
  input: "random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "random_uniform/mul"
  op: "Mul"
  input: "random_uniform/RandomUniform"
  input: "random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 50
          }
          dim {
            size: 100
          }
        }
      }
    }
  }
}
node {
  name: "random_uniform"
  op: "Add"
  input: "random_uniform/mul"
  input: "random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 50
          }
          dim {
            size: 100
          }
        }
      }
    }
  }
}
node {
  name: "GEN/fc1/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@GEN/fc1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "d\000\000\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "GEN/fc1/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@GEN/fc1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "GEN/fc1/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@GEN/fc1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.161245152354
      }
    }
  }
}
node {
  name: "GEN/fc1/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "GEN/fc1/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@GEN/fc1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 100
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 63
    }
  }
}
node {
  name: "GEN/fc1/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "GEN/fc1/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "GEN/fc1/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@GEN/fc1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 100
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "GEN/fc1/weights/Initializer/truncated_normal"
  op: "Add"
  input: "GEN/fc1/weights/Initializer/truncated_normal/mul"
  input: "GEN/fc1/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@GEN/fc1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 100
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "GEN/fc1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@GEN/fc1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 100
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 100
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "GEN/fc1/weights/Assign"
  op: "Assign"
  input: "GEN/fc1/weights"
  input: "GEN/fc1/weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@GEN/fc1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 100
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "GEN/fc1/weights/read"
  op: "Identity"
  input: "GEN/fc1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@GEN/fc1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 100
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "GEN/fc1/MatMul"
  op: "MatMul"
  input: "random_uniform"
  input: "GEN/fc1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 50
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "GEN/fc1/beta/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@GEN/fc1/beta"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "GEN/fc1/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@GEN/fc1/beta"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "GEN/fc1/beta/Assign"
  op: "Assign"
  input: "GEN/fc1/beta"
  input: "GEN/fc1/beta/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@GEN/fc1/beta"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "GEN/fc1/beta/read"
  op: "Identity"
  input: "GEN/fc1/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@GEN/fc1/beta"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "GEN/fc1/gamma/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@GEN/fc1/gamma"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "GEN/fc1/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
